Repository: vocasle/SpaceBattle
Catalog: SpaceBattle/assets/i18n/*/LC_MESSAGES/game.po
Languages: ru

source: Charges left
ru: Заряды

# game_over
source: Sadly, but the game is over. Thank you for playing it. Battleships were placed in following locations:
ru: Печально, но игра закончена. Благодарим за то, что играли в неё. Расположение кораблей:

# refused_to_rush
source: You have refused to rush through the sector.
ru: Вы отказались прорываться через сектор.

# no_obstacles_found
source: HPS did not detect anything near that target point.
ru: ВТС ничего не обнаружил вблизи целевой точки.

# front_projection_lbl
source: Front projection
ru: Проекция сверху

# top_projection_lbl
source: Top projection
ru: Проекция спереди

# player_wants_to_rush_promt
source: Your presence in sector was detected. You might try to rush through the sector. Would you like to rush (yes/no)?
ru: Ваше присутствие в секторе было обнаружено. Вы можете попробовать прорваться через сектор. Хотите попробовать прорваться (да/нет)?

# affirmative_answer
source: yes
ru: да

# rush_through_sector_success
source: You have successfully found a safe point to rush through the sector.
ru: Вы успешно нашли точку для прорыва через сектор.

# rush_through_sector_failure
source: After performing a warp jump you were captured by Unknown Federation's battleship that was residing in those coordinates.
ru: После выполнения прыжка в указанные координаты вы были захвачены кораблями Неизвестной Федерации, которые находились в этих координатах.

# sector_failed
source: Your spaceship was escorted to the Unknown Federation's base.
ru: Ваш космический корабль был сопровождён на базу Неизвестной Федерации.

# target_point_prompt_msg
source: Target point coordinates (X Y Z)
ru: Координаты целевой точки (X Y Z)

# sector_f_intro
source: You are the Chief HPS Engineer on the research spaceship. Your ship is on course to HPS refuelling point. Spaceship's main mission is detection of singularities that prevent good communication with Space Flight Control Centre. The tool that makes that detection possible is high precision scanner (HPS). In 0.5 parsecs from HPS refuelling point you were called on the bridge due to emergency. Spaceship's sensors detected some abnormal radiation in sector F. The Captain ordered to perform low energy scanning on the sector F. Scanners detected 3 battleships nearby. Two 3-decked battleships and one 5-decked command ship. But since scanning was performed in low energy mode you were not able to detect precise location of battleships. You were ordered to detect precise location of the battleships to find a safe route through sector F using HPS. Because you almost used all charges of the HPS in sector E you have only 20 charges left. HPS emits a beam that allows to get precise information of the area nearby the target point. Coordinates of the target point must be entered precisely in following order: X Y Z. The coordinates must be separated by space and after entering the coordinates they must be committed with commit button (Enter). Here is the picture that low energy scanning was able to get. All scanners on the spaceship capture 3D image using right-handed Cartesian coordinate system and report it using two projections of the 3D image: top and front projections.
ru: Вы - Старший инженер ВТС на исследовательском космическом корабле. Ваш корабль взял курс на станцию перезарядки ВТС. Основная цель исследовательского корабля - детектирование сингулярностей, которые препятствуют хорошей связи с Центром Космических Полётов (ЦКП). Устройство, благодаря которому удаётся детектировать сингулярность - высокоточный сканер (ВТС). В 0.5 парсеках от станции перезарядки ВТС вас вызывают на борт в связи с чрезвычайной ситуацией. Сенсоры космического корабля обнаружили необычное радиационное поле в секторе F, в который вы вошли некоторое время назад. Капитан приказал провести низкоуровневое сканирование сектора F. Сканеры определили 3 военных корабля неизвестной вам федерации. Два двухпалубных линкора и один 5-палубный командный корабль. В связи с тем, что было проведено низкоуровневое сканирование с целью не выдать своё местоположение команде вашего корабля удалось лишь частично определить местоположение кораблей. Вам был отдан приказ найти точное местоположение кораблей с помощью ВТС для того, чтобы можно было проложить безопасный маршрут через сектор F. В секторе E вы обнаружили сильную аномалию, на устранение которой ушла большая часть зарядов ВТС. На текущий момент осталось 20 зарядов. ВТС испускает луч, который позволяет получить точную информацию вблизи целевой точки. Координаты целевой точки должны быть заданы точно в следующем формате: X Y Z. Координаты разделяются пробелом и наводка ВТС осуществляется нажатием на кнопку подтверждения целевой точки (Enter). Все сканеры на корабле выводят две проекции трёхмерного изображения, используя правостороннюю декартову систему координат. Вот проекции полученные низкоэнергетическим сканером.

# sector_k_intro
source: Thanks to you navigator could find a safe route through the sector F to the refuelling point. However, only 50% of HPS were refuelled and emergency signal occurred again. In the same sector (sector K) unknown batch of spaceships came out from warp jump. Your scanners detected four three-decked spaceships, two five-decked spaceships and six two-decked spaceships. You must discover their precise location as fast as possible to send a message to Space Flight Control Centre about meeting with unknown civilization and their coordinates. Do not get upset, this is the last scanning you must complete before you can jump into the safe sector.
ru: Благодаря вам штурман смог проложить безопасный маршрут к станции перезарядки ВТС. Однако, не успели вы заправить ВТС и до половины, как пришёл сигнал о том, что в одном с вами секторе (секторе К) вышла из гипер-прыжка целая группа неизвестных кораблей. Ваши сканеры обнаружили 4 трёхпалубных, 2 пятипалубных и 6 двухпалубных кораблей. Вам необходимо обнаружить их точное местоположение как можно скорее, чтобы отправить сообщение в ЦКП о встрече с неизвестной цивилизацией и их местоположением. Не расстраивайтесь, это последнее сканирование, которое необходимо выполнить перед прыжком в безопасный сектор.

# sector_r_intro
source: But look, what is it? While the pilot was working on preparing the spaceship for the warp jump your ship received a message from unknown guest, but what is this language? Unfortunately, there is no linguist on board so you must decipher the message yourself. But look, your colleagues trying to assist you and suggest you that this is not an unknown language, that is a cipher. And it looks like it has some relations with English alphabet. Shall we try?
ru: Ого, смотрите, что это? Пока пилот подготавливал корабль к прыжку вам пришло сообщение от неизвестного гостя, но на каком это языке? К сожалению, на вашем корабле нет лингвиста и вам придётся самостоятельно расшифровать послание. Но присмотритесь, кажется ваши коллеги заметили какую-то закономерность. Это ведь не неизвестный язык, это шифр. Кажется, цифры имеют какое-то отношение к английскому алфавиту. Ну что же попробуем?

# prompt_cipher_txt
source: Deciphered message is
ru: Расшифрованное сообщение

# cipher_lbl
source: Received message in unknown language
ru: Полученное сообщение на неизвестном языке

# bonus_txt
source: All ships were discovered! And again, you have confirmed your high qualification.
ru: Все корабли обнаружены! Вы в очередной раз подтвердили свою высококлассную квалификацию!

# game_over_final_txt
source: The message is “we came in peace” indeed. Remember this moment. You have become the first human in human history that made a contact with extra-terrestrial civilization. This is great day for our civilization and a large step for whole humanity. P.S. Do not fear to explore unknown and hold peace in your heart wherever you go.
ru: Послание расшифровано "мы пришли с миром". Запомните это мгновение. Вы только что стали первым человеком в истории человечества, который установил контакт с внеземной цивилизацией. Это великий день для нашей цивилизации, это огромный шаг для всего человечества. P.S. Не бойтесь исследовать неизвестное и несите мир в своём сердце, куда бы вы не следовали.

# not_valid_target_point
source: is not a valid target point coordinates.
ru: является некорректными координатами для целевой точки.

# incorrect_dechiper
source: Messages differ
ru: Сообщения отличаются

# colleague_dechipered_first
source: Your colleague deciphered the message - "w e c a m e i n p e a c e".
ru: Ваш коллега расшифровал сообщение - "w e c a m e i n p e a c e".
